tier_maker/app/controllers/tier_lists_controller.rb

  def index
    @tier_lists = TierList.all
---
SELECT "tier_lists".* FROM "tier_lists"

  def create
    @tier_list = TierList.new(tier_list_params)

    if @tier_list.save
---
INSERT INTO "tier_lists" ("name", "uuid", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "New Tier List"], ["uuid", "307406ea-b6c8-42bd-b72c-530e0115c8e8"], ["created_at", "2024-08-29 17:56:24.997573"], ["updated_at", "2024-08-29 17:56:24.997573"]]

  def update
    if @tier_list.update(tier_list_params)
---
UPDATE "tier_lists" SET "updated_at" = ? WHERE "tier_lists"."id" = ?  [["updated_at", "2024-08-29 17:56:25.036537"], ["id", 3]]